//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "Result_Win.h"
#include "Result_Lose.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
class Result {
	Result_Win rwin;
	Result_Lose rlose;
public:
	HRESULT Init(void);
	void Finalize(void);
	void Update(void);
	void Draw(void);

	int result_num=1;
	int stage_num;
};



